from src.reports import spending_by_category


def test_spending_by_category():
    mock_operations = [
        {"Дата операции": "10.12.2021", "Категория": "Супермаркеты", "Сумма операции": -1000},
        {"Дата операции": "15.12.2021", "Категория": "Каршеринг", "Сумма операции": -500},
        {"Дата операции": "01.05.2021", "Категория": "супермаркеты", "Сумма операции": -2000},
        {"Дата операции": "10.01.2022", "Категория": "Супермаркеты", "Сумма операции": -300},
    ]
    result = spending_by_category(mock_operations, "Супермаркеты", "25.12.2021")
    assert len(result) == 1
    assert result[0]["Сумма операции"] == -1000
    assert result[0]["Категория"] == "Супермаркеты"
